import { CustomEvent } from "../types/event";

const events: CustomEvent[] = [
  {
    name: "長期金利の上昇",
    effect: [0, 3, 0, 0, 0],
    description: "長期金利が上昇し、B社の株価が3段階上昇する見込み。",
  },
  {
    name: "ITバブル",
    effect: [0, 1, 0, 0, 3],
    description:
      "ITバブルが発生し、B社の株価が1段階、E社の株価が3段階上昇する見込み。",
  },
  {
    name: "原油高",
    effect: [-1, 0, 0, 1, 0],
    description:
      "原油価格が上昇し、A社の株価が1段階下落、D社の株価が1段階上昇する見込み。",
  },
  {
    name: "シミュレーションLab、赤字を発表",
    effect: [0, 0, 0, -3, 0],
    description: "D社が赤字を発表し、D社の株価が3段階下落する見込み。",
  },
  {
    name: "金融緩和",
    effect: [0, 1, 0, 1, 2],
    description:
      "金融緩和が行われ、B社の株価が1段階、D社の株価が1段階、E社の株価が2段階上昇する見込み。",
  },
  {
    name: "東京オリンピック",
    effect: [0, 2, 2, 1, 2],
    description:
      "東京オリンピックが開催され、B社の株価が2段階、C社の株価が2段階、D社の株価が1段階、E社の株価が2段階上昇する見込み。",
  },
  {
    name: "コロナショック",
    effect: [-1, -1, 0, -2, -1],
    description:
      "コロナショックが発生し、A社の株価が1段階下落、B社の株価が1段階下落、D社の株価が2段階下落、E社の株価が1段階下落する見込み。",
  },
  {
    name: "不景気",
    effect: [0, -1, -1, -1, -2],
    description:
      "不景気が発生し、B社の株価が1段階下落、C社の株価が1段階下落、D社の株価が1段階下落、E社の株価が2段階下落する見込み。",
  },
  {
    name: "システム物流、商品が大ヒット",
    effect: [0, 0, 3, 0, 0],
    description: "C社の商品が大ヒットし、C社の株価が3段階上昇する見込み。",
  },
  {
    name: "物質・材料開発機構、倉庫で火災",
    effect: [-3, 0, 0, 0, 0],
    description: "A社の倉庫で火災が発生し、A社の株価が3段階下落する見込み。",
  },
  {
    name: "好景気",
    effect: [0, 3, 1, 0, 2],
    description:
      "好景気が続き、B社の株価が3段階、C社の株価が1段階、E社の株価が2段階上昇する見込み。",
  },
  {
    name: "物質・材料開発機構、新製品発表",
    effect: [3, 0, 0, 0, 0],
    description: "A社が新製品を発表し、A社の株価が3段階上昇する見込み。",
  },
  {
    name: "リーマンショック",
    effect: [0, -3, 0, -1, -2],
    description:
      "リーマンショックが発生し、B社の株価が3段階下落、D社の株価が1段階下落、E社の株価が2段階下落する見込み。",
  },
  {
    name: "原油安",
    effect: [1, 0, 0, -1, 0],
    description:
      "原油価格が下落し、A社の株価が1段階上昇、D社の株価が1段階下落する見込み。",
  },
  {
    name: "バブル経済",
    effect: [0, 2, 1, 0, 3],
    description:
      "バブル経済が発生し、B社の株価が2段階、C社の株価が1段階、E社の株価が3段階上昇する見込み。",
  },
  {
    name: "総理大臣辞任",
    effect: [1, 1, 1, 1, 2],
    description:
      "総理大臣が辞任し、A社の株価が1段階、B社の株価が1段階、C社の株価が1段階、D社の株価が1段階、E社の株価が2段階上昇する見込み。",
  },
];

export default events;
